import numpy as np
from set_model import models

##采取标准色度值
label=[[116,81,67],[199,147,129],[91,122,156],[90,108,64],[130,128,176],[92,190,172],[224,124,47],[68,91,170],
   [198,82,97],[94,58,106],[159,189,63],[230,162,39],[35,63,147],[67,149,74],[180,49,57],[238,198,20],
   [193,84,151],[0,136,170],[245,245,243],[200,202,202],[161,163,163],[121,121,122],[82,84,86],[49,49,51]]

#导入采样数据
data = np.loadtxt('data/rgb.csv', delimiter=',',dtype=int)
data_list = data.tolist()
# print(data_list)

X3=models(label,data_list)#3*3系数矩阵
matr=np.mat([[94,63,45]])
pre=X3.T*matr.T
print()